import { TypographyH1 } from "@/components/ui/Typography/TypographyH1";
import { TypographyP } from "@/components/ui/Typography/TypographyP";

export const Astrology = () => {
  return (
    <div>
      <TypographyH1>Астрология</TypographyH1>
      <TypographyP>
        Астрология — это уникальная система знаний, основанная на изучении взаимосвязей между
        положением небесных тел в момент рождения человека и его характеристиками, событиями в жизни
        и судьбой.
      </TypographyP>
      <br />
      <TypographyP>
        Основной элемент астрологии — знаки зодиака, которые делят зодиакальный пояс на 12 равных
        частей. Каждый знак представляет собой уникальный энергетический образ и влияет на характер
        и поведение людей, рожденных под его знаком.
      </TypographyP>
      <br />
      <TypographyP>
        Астрология также включает в себя планеты, их положение в домах зодиака и аспекты между ними.
        Интерпретируя эти факторы, астрологи предсказывают события в жизни человека, его личные
        качества и потенциалы.
      </TypographyP>
      <br />
      <TypographyP>
        Многие люди обращаются к астрологии для самопознания, понимания своей судьбы, а также
        получения рекомендаций по принятию решений в важных сферах жизни.
      </TypographyP>
    </div>
  );
};
